INSTITUTE OF ENGINEERING AND MANAGEMENT KOLKATA
DEPARTMENT OF COMPUTER SCIENCE
COMPUTER NETWORKS CS 692
DATE :- 04.04.2019


Aim: Configure a Network using Distance Vector Routing protocol.  
       ⇒ RIP


⇒ 
  



Router 0 ⇒
Router>en
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int lo0


Router(config-if)#
%LINK-5-CHANGED: Interface Loopback0, changed state to up


%LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback0, changed state to up


Router(config-if)#ip address 10.1.1.1 255.255.255.0
Router(config-if)#int f0/0
Router(config-if)#ip address 10.1.12.1 255.255.255.0
Router(config-if)#no shut


Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up


Router(config-if)#int f0/1
Router(config-if)#ip address 10.1.14.1 255.255.255.0
Router(config-if)#no shut


Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/1, changed state to up


Router(config-if)#exit
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console


Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router rip
Router(config-router)#net 10.0.0.0
Router(config-router)#end
Router#
%SYS-5-CONFIG_I: Configured from console by console


Router#
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up


%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up


Router 1 ⇒


Router>en
Router#con
Router#con
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int lo0


Router(config-if)#
%LINK-5-CHANGED: Interface Loopback0, changed state to up


%LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback0, changed state to up


Router(config-if)#ip address 10.1.2.1 255.255.255.0
Router(config-if)#no shut
Router(config-if)#int f0/1
Router(config-if)#ip address 10.1.23.1 255.255.255.0
Router(config-if)#no shut


Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/1, changed state to up


Router(config-if)#int f0/0
Router(config-if)#ip address 10.1.12.2 255.255.255.0
Router(config-if)#no shut


Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up


%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up


Router(config-if)#end
Router#
%SYS-5-CONFIG_I: Configured from console by console


Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router rip
Router(config-router)#net 10.0.0.0
Router(config-router)#end
Router#
%SYS-5-CONFIG_I: Configured from console by console


Router#
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up




Router 2 ⇒


Router>en
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int lo0


Router(config-if)#
%LINK-5-CHANGED: Interface Loopback0, changed state to up


%LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback0, changed state to up


Router(config-if)#ip address 10.1.3.1 255.255.255.0
Router(config-if)#no shut
Router(config-if)#int f0/0
Router(config-if)#ip address 10.1.23.2 255.255.255.0
Router(config-if)#no shut


Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up


%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up


Router(config-if)#int f0/1
Router(config-if)#ip address 10.1.34.1 255.255.255.0
Router(config-if)#no shut


Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/1, changed state to up


Router(config-if)#exit
Router(config)#router ri
Router(config-router)#net 10.0.0.0
        
Router(config-router)#end
Router#
%SYS-5-CONFIG_I: Configured from console by console


Router#
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up


Router 3 ⇒


Router>en
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int lo0


Router(config-if)#
%LINK-5-CHANGED: Interface Loopback0, changed state to up


%LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback0, changed state to up


Router(config-if)#ip address 10.1.4.1 255.255.255.0
Router(config-if)#no shut
Router(config-if)#int f0/0
Router(config-if)#ip address 10.1.34.2 255.255.255.0
Router(config-if)#no shut


Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up


%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up


Router(config-if)#int f0/1
Router(config-if)#ip address 10.1.14.2 255.255.255.0
Router(config-if)#no shut


Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/1, changed state to up


%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up


Router(config-if)#exit
Router(config)#router rip
Router(config-router)#net 10.0.0.0
Router(config-router)#end
Router#
%SYS-5-CONFIG_I: Configured from console by console